Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་རིག་སྔགས་འཆང་གིས་ཇི་སྐད་གསུངས་པའི་ཆོ་ག་ཞིབ་མོ་སྒྲུབ་པར་བགྱིད་ན།
en: The power of his intellect will be invincible. “Noble Avalokiteśvara will confer boons upon the vidyā holder—he will appear to him whenever wished for and grant boons generously. He will grant him victory in every way, so that the vidyā holder will always be victorious over all his enemies, opponents, and adversaries and over all wicked beings. He will be invisible to all yakṣas, rākṣasas, bhūtas, piśācas, vighnas, vināyakas, asuras, and nāgas. He will become fearless like all noble ones. All kings and royal ministers with their harems and retinues will come under his control. He will be universally idolized and be treated as everyone’s favorite teacher. He will live a long life free of disease and all the impurities of hatred, envy, and jealousy. His memory will be excellent and his body pure. “

source: དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱིས་བརླབས་དང་།
en: At the time of death, he will really see the tathāgatas. Noble Avalokiteśvara will also appear to him.

source: དེ་བཞིན་གཤེགས་པའི་བཀའ་རྗེས་སུ་གནང་བ་དེ་དག་ཐམས་ཅད་བདག་གིས་སྩལ་བར་བགྱིའོ།
en: They will all comfort him, saying, ‘Come son, follow us to the realm of Sukhāvatī!’ He will thus die fully aware of where he is going. The gates of all the hells will be closed, he will be saved from all unhappy destinies, and his current birth will be his last. He will have complete recall of his successive past births. Wherever he steps, a lotus will spring up under his shoe. He will pass from one buddha field to another until he reaches ultimate and final awakening. “

source: །བཅོམ་ལྡན་འདས་གལ་ཏེ་རིག་སྔགས་འཆང་སྒྲུབ་པ་དང་བྲལ་བར་གྱུར་ན། བཅོམ་ལྡན་འདས་དེ་ནི་བདག་གིས་མ་ནོངས་སོ།
en: However, if someone has failed to accomplish the practices of a vidyā holder, it is not me who will be at fault.

source: །དེ་ལྟ་བས་ན་རིག་སྔགས་འཆང་གིས་ཅི་སྐད་གསུངས་པའི་ཆོ་ག་དང་། ཆོ་ག་ཞིབ་མོ་སྒྲུབ་པས། གསང་སྔགས་དང་། ཕྱག་རྒྱ་བསྒྲུབ་པར་བགྱི་སྟེ།
en: For this reason, as a vidyā holder, one should engage in the formal practice that involves the mantra and the mudrā according to the ritual procedure as described.

source: དགོས་པ་དེ་དག་ཐམས་ཅད་ཐེ་ཚོམ་མ་མཆིས་པར་འགྲུབ་པར་འགྱུར་རོ།
en: One will then magically accomplish all one’s tasks; there is no doubt about this. “

source: །དེ་ནས་གསང་སྔགས་བཟླས་ཏེ།
en: One should repeat the following mantras: [26] “Oṁ, holder of the amogha treasury!

source: ཨོཾ་ཨ་མོ་གྷ་པཱ་ཤ་དྷ་ར་ས་ར་པྲ་ས་ར་ཧཱུྃ།
en: Unfold, expand, hūṁ! “

source: མཆོད་ཕྱིར་ཐོགས་པའི་སྐུད་པའི་གསང་སྔགས་ཏེ།
en: This is the mantra of the sacred thread.

source: གཞོན་ནུ་མས་བཀལ་བའི་སྐུད་པ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས།
en: One should incant a thread spun by a young girl with this mantra one hundred and eight times and wind it around one’s neck three times. [

source: མདུད་པ་གསུམ་དོར་བར་བགྱིའོ།
en: 27] “Oṁ, amogha garments!

source: །ཨོཾ་ཨ་མོ་གྷ་པྲ་བར་ཎ་མུ་རུ་མུ་རི་དི་བྱ་ཀ་ཤི་ཀཾ །
en: Muru muri! Become divinely soft!

source: སཾ་བྷ་བ་ཏུ་ཏ་ར་ཏ་ར་སྭཱ་ཧཱ།
en: Tara tara, svāhā! “

source: གོས་ཀྱི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for the garments; it should be recited twenty-one times. [28] “Oṁ, amogha clothes!

source: །ཨོཾ་ཨ་མོ་གྷ་བསྟྲ་ཎྱོཏ་ཀྵི་པཱ་མི་བོ་དྷི་ནི་པད་མེ་སྭཱ་ཧཱ།
en: I cast off clothes within the lotus that brings awakening, svāhā! “

source: གོས་བཏེག་པའི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for casting off clothes; it should be recited twenty-one times. [29] “Oṁ, collecting the rainwater, you flow along the amogha banks!

source: །ཨོཾ་དི་བྱོཏྐ་སཾ་བྷུ་ཏ་ཨ་མོ་གྷ་བ་རུ་ན་ཙ་རེ྅་བྷི་ཥིཉྩྱ་ཧཱུྃ།
en: Consecrate! Hūṁ! “

source: ཁྲུས་ཀྱི་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for bathing; it should be recited twenty-one times. [

source: །ཨོཾ་ཨ་མྲྀ་ཏ་ཨ་མོ་གྷ་པདྨ་ས་ནེ།
en: 30] “Oṁ, amogha lotus seat of nectar, raining down!

source: སྤརྴ་ནི་ཙུ་རུ་ཙུ་རུ་སྭཱ་ཧཱ།
en: Curu curu, svāhā! “

source: ཉེ་རེག་གི་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for ablutions; it should be recited twenty-one times. [

source: །ཨོཾ་ཨ་མོ་གྷ་རཀྵ་ཎི་ཀུ་རུ་ཀུ་རུ་སྭཱ་ཧཱ།
en: 31] “Oṁ, amogha protection!

source: བདག་བསྲུང་བ་སྟེ།
en: Take effect, do! “

source: ཡུངས་ཀར་དང་ཆབ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ནས། རང་གི་ལུས་ལ་དབང་བསྐུར་རོ།
en: The vidyā holder should perform the protection of his body by sprinkling it with mustard water incanted twenty-one times. [

source: །ཨོཾ་ཨ་མོ་གྷ་ས་མ་ཡ།
en: 32] “Oṁ, amogha samaya!

source: མ་ཧཱི་པདྨེ་ཏིཥྛ་ཏིཥྛ་ཧཱུྃ།
en: Remain within the great lotus, hūṃ! “

source: དམ་ཚིག་གི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the samaya mantra; it should be repeated seven times. [33] “Oṁ, you who never fail in any way!

source: །ཨོཾ་སརྦ་ཏྲ་ཨ་མོ་གྷ་བ་པ་ཏི་ཏིཥྛ་ར་ཀྵཾ་ཏུ་ཧཱུྃ།
en: Remain and protect, hūṁ! “

source: སློབ་མ་དང་གྲོགས་བགྱིད་པ་བསྲུང་བ་སྟེ། ཐལ་བ་ལ་ལན་བདུན་བཟླས་ནས་དཔྲལ་བར་ཐིག་ལེ་བགྱིའོ།
en: One should perform the protection of disciples and assistants by marking a bindi on their forehead with ashes incanted with this mantra seven times. [

source: །ཨོཾ་ཏྲཻ་ལོ་ཀྱ་པདྨ་ཨ་མོ་གྷ་ཀྲ་མ་ཎེ་མི་ལི་མི་ལི་སྭཱ་ཧཱ།
en: 34] “Oṁ, you who overstep the three worlds with amogha lotus steps! Mili mili, svāhā! “

source: གོམ་པ་འདོར་བའི་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིའོ།
en: This is the mantra for positioning the feet in a stride; it should be recited twenty-one times. [

source: །ཨོཾ་པདྨེ་མ་ཧཱ་པདྨེ་ས་ར་ས་ར།
en: 35] “Oṁ, unfold within the lotus, the great lotus!

source: ས་མན་ཏེ་ན་པ་རི་བེཥྚ་ཡ།
en: Surround everything with the unfailing noose!

source: ཨ་མོ་གྷ་པ་ཤེ་ན་སུ་རུ་སུ་རུ་སྭཱ་ཧཱ།
en: Huru huru, svāhā! “

source: ཚོན་སྐུད་སྣ་ལྔ་ལ་ལན་བདུན་བཟླས་ཏེ་དཀྲི་བར་བྱའོ།
en: One should incant a five-colored thread seven times with this mantra and wind the thread. [36] “Oṁ, bright multicolored amogha cloth!

source: །ཨོཾ་བི་ཙི་ཏྲ་ཨ་མོ་གྷ་པ་ཏཱ་ན་ན་རང་ག་བི་ཤུད་དྷཱ་ཡ།
en: Effect purification!

source: ཀི་ཎི་ཀི་ཎི་སྭཱ་ཧཱ།
en: kiṇi kiṇi, hūṁ! “

source: བ་དན་གྱི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the banner; it should be recited seven times. [37] “Oṁ, diamond-tipped amogha arrow!

source: །ཨོཾ་ཨ་མོ་གྷ་ཤ་ར་བཛྲ་ཏུཎྜ་ཐ་ར་ཐ་ར་སྭཱ་ཧཱ།
en: Thara thara, svāhā! “

source: མདའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the arrow; it should be recited seven times. [38] “Oṁ, the great, completely pure, broad amogha gate!

source: །ཨོཾ་བི་པུ་ལ་ཨ་མོ་གྷ་མ་ཧཱ་དྷ་ར་བི་ཤུད་དྷེ་སི་རི་སི་རི་སྭཱ་ཧཱ།
en: Siri siri, svāhā! “

source: རྟ་བབས་ཀྱི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for the gate; it should be recited twenty-one times.

source: །སུ་དག་དེར་ཞུགས་ནས་མཐོ་རིས་ཀྱི་སྒོར་ཞུགས་པར་འགྱུར་རོ།
en: By merely passing through this gate, one enters the gate of heaven.

source: །སྡིག་པ་དང་སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་བྱང་བར་འགྱུར་རོ།
en: All wrongdoings and obscurations become completely purified. [

source: །ཨོཾ་ནཱ་ནཱ་བི་ཙི་ཏྲ།
en: 39] “Oṁ, you are filled and surrounded with various splendid amogha flowers and fruits!

source: ཨ་མོ་གྷ་པུས་པ། ཕ་ལ་ཏཱ་ཀཱི་རྣ་པཱུར་ཡ་པ་ར་པ་ར་ཧཱུྃ།
en: Para para, hūṁ! “

source: བུམ་པ་གང་བའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ། །ཨོཾ་ཨ་མོ་གྷ་རཏྣ་བི་མ་ཎ།
en: This is the mantra for the full jar; it should be recited seven times. [

source: ཀ་ཊ་ད་ཙ་ཨ་དྲྀཥྚི་བིད་བྱ་གན་དྷོ་ཛྭ་ལ་སྥར་ཎ།
en: 40] “Oṁ, jewel amogha palace, consecrated with the sacrificial vessel, you are divinely fragrant and radiating light everywhere!

source: ས་མན་ཏེ་ན་ཛྭ་ལ་ཛྭ་ལ་སྭཱ་ཧཱ།
en: Shine, shine, svāhā! “

source: པོག་ཕོར་གྱི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the sacrificial incense vessel; it should be recited seven times. [

source: །ཨོཾ་ཛྭ་ལ་བ་ཏི།
en: 41] “Oṁ, shining water jar, you cause the flow!

source: རད་ན་གྷ་ཏ། རི་སི་ཎི་ཏུ་ཊི་ཏུ་ཊི་སྭཱ་ཧཱ།
en: Tuṭi tuṭi, svāhā! “

source: གཏོར་མའི་སྣོད་ཀྱི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the bali offered in a water jar; it should be recited seven times. [42] “Oṁ, divine vessel!

source: །ཨོཾ་ད་བྱི་པྷཉྫ་ན་ཨ་མོ་གྷ་པདྨ་བ་རེ་པཱུ་ར་ཡ་ཧཱུྃ།
en: Supreme amogha lotus! Fill up, hūṁ! “

source: ཁམ་ཕོར་གྱི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the pot with a lid; it should be recited seven times. [

source: །ཨོཾ་ཨ་མོ་གྷ་སཾ་པཱུ་ར་ཎི་དྲོ་ཎ་གྷན་དྷ་པ་ཏི་སྭཱ་ཧཱ།
en: 43] “Oṁ, the scented amogha basin that fills to the brim! Svāhā! “

source: ཐིག་ལེའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the water basin; it should be recited seven times. [

source: །ཨོཾ་ས་ར་ནི་སཱ་ར་ཡ།
en: 44] “Oṁ, flowing stream!

source: ཨ་མོ་གྷ་བྷུ་ཛ་ནེ་མཱ་ད་ནེ་ཧཱུྃ།
en: O amogha dish, release the stream! Intoxicator, intoxicate! Hūṁ! “

source: རིལ་བ་མགྲིན་རིངས་ཀྱི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the water vessel with a long neck; it should be recited seven times. [

source: །ཨོཾ་རཏྣ་དི་བྱ།
en: 45] “Oṁ, divine one with the jewel vase!

source: རཏྣ་ཀུཾ་བྷ་བ་ཏི་སཱ་ག་ར་སཾ་པཱུ་ར་ཎི་སྭཱ་ཧཱ།
en: You fill the oceans, svāhā! “

source: བུམ་པའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the vase; it should be recited seven times. [

source: །ཨོཾ་བི་ཙི་ཏྲོ་ཛྭ་ལ་ནཱན་རཾ་ག་བི་བྷཀྟ་ཡ་སཾ་ཤོ་དྷ་ཡ་ཏུ་ཊི་སྭཱ་ཧཱ།
en: 46] “Oṁ, brightly blazing with different colors! Make the divisions distinct!

source: ཚོན་རྩིའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: Purify! Tuṭi, svāhā! “This is the mantra for the paints; it should be recited seven times. [

source: །ཨོཾ་དི་བྱ་ཨ་བ་ལོ་ཀི་ནི་བི་བྷ་ཛ་ཡཾ་ཏུ་ས་མན་ཏེ་ན་ས་མ་ར་ཎེ་སྭཱ་ཧཱ།
en: 47] “Oṁ, gazing vidyā! Divide the entire area! Stretch forth! Stretch symmetrically,svāhā! “

source: ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ཏེ་སོ་སོར་དབྱེ་བར་བགྱིའོ།
en: One should recite this mantra twenty-one times and then do the dividing. [

source: །ཨོཾ་ནཱ་ནཱ་པྲ་ཧཱ་ར་ཎ་ཨ་མོ་གྷ་མུ་དྲཱ་ཛྭ་ལ་ཛྭ་ལ་སྭཱ་ཧཱ།
en: 48] “Oṁ, the various implements that constitute amogha emblems! Blaze, blaze, svāhā! “

source: ཕྱག་མཚན་བྲི་བ་སྟེ་ལན་བདུན་བཟླས་སོ།
en: One should draw the relevant emblems and recite the mantra seven times. [49] “Oṁ, supreme amogha jewel thread!

source: །ཨོཾ་ཨ་མོ་གྷ་རཏྣ་སཱུ་ཏྲ་དྷ་རེ་ཀི་ཎི་ཀི་ཎི་སྭཱ་ཧཱ།
en: Kiṇi kiṇi, svāhā! “This is the mantra for the thread.

source: ཐིག་སྐུད་ཀྱི་གསང་སྔགས་ཏེ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ཏེ་དཀྱིལ་འཁོར་རམ། རི་མོ་བྲིས་པའི་རས་སམ། གཞན་གཞི་གང་ཡང་རུང་བ་ལ་གདབ་པར་བྱའོ།
en: One should recite it one hundred and eight times and use the incanted thread to surround the maṇḍala, cloth painting, or anything to be enclosed within an area. [

source: །ཨོཾ་བི་པུ་ལ་བ་རེ་པྲ་བེ་ཤ་ཡ། ཨོཾ་མོ་གྷ་པདྨེ་ཧཱུྃ།
en: 50] “Oṁ, cause them to enter the supreme, wide amogha lotus, hūṁ! “

source: སྒོའི་ཆ་དབྱེ་བའི་གསང་སྔགས་ཏེ་སྒོ་རེ་རེར་ཡང་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This mantra should be recited twenty-one times over each of the gates when mapping out their locations. The gates will then become well arranged and auspicious. [

source: །ཨོཾ་སུ་བི་བྷཀྟི་སུ་མངྒ་ལ་དྭཱ་ར་བྷ་བནྟི།
en: 51] “Oṁ, divine dish, the supreme golden amogha dish!

source: ཨོཾ་དི་བྱ་བཱ་ཛ་ན། ཨ་མོ་གྷ་པཱ་ཤན་པ་ན་བ་རེ། གི་རི་གི་རི་ཧཱུྃ།
en: Giri giri, hūṁ! [

source: ཨོཾ་སཾ་པཱུརྣ།
en: 52] “Oṁ, divine silver dish, fully filled!

source: རཱུ་པྱ་དི་བྱ་བྷ་ཛ་ནི། ཨ་མོ་གྷ་པདྨེ་སྭཱ་ཧཱ།
en: O amogha lotus, svāha! “

source: ལན་བདུན་བཟླས་པར་བགྱིའོ།
en: This mantra should be recited seven times. [

source: །ཨོཾ་བི་བི་དྷ་རཱུ་པ་ཧཱ་རོ་པ་ཀྵ་ར་ཎ།
en: 53] “Oṁ, oblatory foods and implements!

source: ཙ་ལ་ཙ་ལ།
en: Move, move!

source: ཨ་མོ་གྷ་བ་ཏི་སྭཱ་ཧཱ།
en: You are not subject to failure, svāhā! “

source: །ཨོཾ་དི་བྱ་གནྡྷ་ནུ་ས་ར་ནི་ཨ་མོ་གྷ་བ་ལེ་དྷ་ར་དྷ་ར་སྭཱ་ཧཱ།
en: Amogha power! Hold, hold, svāhā! “

source: མཆོད་ཡོན་གྱི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the welcome offering; it should be recited seven times. [

source: །ཨོཾ་གྷནྡྷ་སྥ་ར་ཎི་ས་མནྟ།
en: 55] “Oṁ, you spread fragrance!

source: ཨ་མོ་གྷ་པྲ་སྥུ་ར་ཧཱུྃ།
en: Amogha-spread it everywhere, hūṁ! “

source: དྲིའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the perfume; it should be recited seven times. [56] “Oṁ, you purify the body, making it immaculate! You fill it with divine fragrance!

source: །ཨོཾ་ནི་རྨ་ལ་ཀཱ་ཡ་ཤོ་དྷ་ནི་དི་བྱ་གནྡྷ་པྲ་པཱུ་ར་ཡ་ནི་པཱུ་ར་ཡ་ཧཱུྃ།
en: Fill it, fill, hūṁ! “

source: བྱུག་པའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the scented oils; it should be recited seven times. [

source: །ཨོཾ་གནྡྷ་ཙཱུརྞ་པྲ་པཱུ་ར་ཎི།
en: 57] “Oṁ, you provide the full measure of scented powders!

source: ཙུ་རུ་ཙུ་རུ་སྭཱ་ཧཱ།
en: Curu curu, svāhā! “

source: དྲིའི་ཕྱེ་མའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the scented powders; it should be recited seven times. [

source: །ཨོཾ་ས་མནྟེ་ན།
en: 58] “Oṁ, supreme pure fragrance that evenly spreads everywhere!

source: བི་མ་ལེ་གནྡྷོཏྟ་རེ་སྭཱ་ཧཱ།
en: Svāhā! “

source: བསྐུལ་བའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the unguents; it should be recited seven times. [59] “Oṁ, you provide the full measure of divine fragrance!

source: །ཨོཾ་དི་བྱ་གན་དྷ་པྲ་པཱུ་ར་ནི་སཱ་ག་ར་ཛ་ལ་དི་བྱ་ཨ་དྷིཥྛི་ཏེ་ཀ་ལ་ཤོ་དཱ་ར་པཱུ་རྞ་པཱུ་ར་ཡ།
en: Divinely consecrated as the water of the ocean, you fill the interior of the water pitcher!

source: ཛ་ཡ་སིད་དྷེ་སྭཱ་ཧཱ།
en: Fill it, O bringer of victory, svāhā! “

source: བུམ་པའི་དྲི་ཆབ་ཀྱི་གསང་སྔགས་ཏེ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་སོ།
en: This is the mantra for the pitcher with scented water; it should be recited one hundred and eight times. [

source: །ཨོཾ་ར་ས་སཱ་གྲ་བ་ཏི།
en: 60] “Oṁ, you possess the most exquisite of flavors!

source: སརྦ་བི་དྷ་ཨ་དྷི་ཥྛཱ་ན་ཨ་དྷི་ཥྛིཏེ་སཾ་པཱུ་ར་ཡ་ཧཱུྃ།
en: Blessed by all the vidyās! Become complete, hūṁ! “

source: གཏོར་མ་རོ་སྣ་ཚོགས་ཅན་གྱི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra of the many-flavored bali; it should be recited twenty-one times. [

source: །ཨོཾ་དི་བྱ་བྷོ་ཛ་ན།
en: 61] “Oṁ, divine food of great splendor!

source: སཾ་པཱུ་ར་ཡ། བི་པཱུ་ལ་པྲ་བྷེ་སྭཱ་ཧཱ།
en: Fill the stomach, svāhā! “

source: ཁ་ཟས་ཀྱི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for the food; it should be recited twenty-one times. [62] “Oṁ, the three “white” foods! Bali with a broad range of exquisite tastes!

source: །ཨོཾ་ཏྲི་ཤུ་ཀླ་བྷོ་ཛ་ན་བ་ལི་བི་པུ་ལ་ར་སཱ་གྲ་བ་ཏི་སུ་ར་པྲ་སུ་ར་ཧཱུྃ།
en: Sura prasura, hūṁ! “

source: ཟས་དཀར་གསུམ་གྱི་གཏོར་མའམ། གཏོར་མ་གཞན་ལ་ཡང་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra of the three ‘white’ foods and other foods offered as bali; it should be recited twenty-one times. [

source: །ཨོཾ་བ་ལ་ཏི་སཱ་ར་བ་ཏི་དི་བྱ་བ་ན་སྤ་ཏི།
en: 63] “Oṁ, divine tree of the forest, rich in fruit and sap!

source: ཏ་ར་ཏ་ར་ནི་སྭཱ་ཧཱ།
en: Tara tara, tuni, svāhā! “

source: འབྲས་བུའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for fruit; it should be recited seven times. [64] “Oṁ, you rain down various flowers such as celestial water lilies!

source: །ཨོཾ་དི་བྱ་ཀུ་སུ་མོཏྤ་ལ་ནཱ་ནཱ་པུཥྤ་པྲ་བརྵ་ཎི་བྷ་བ་སྭཱ་ཧཱ།
en: Stay on, stay! Svāhā! “

source: མེ་ཏོག་གི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the flowers; it should be recited seven times. [65] “Oṁ, forest tree overhung with various vines and flowers!

source: །ཨོཾ་བི་བི་དྷ་ལ་ཏཱ་བུཥྦཱ་ཀུན་ཋི་ཏ་བ་ན་སྦ་ཏི་ཨཱ་ཧ་ར་སཾ་བཱུརྞ་ཀུམ་བྷེ་སྭཱ་ཧཱ།
en: Jar filled with food!Svāhā! “

source: མེ་ཏོག་གཏོར་བའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the flowering vines; it should be recited seven times. [

source: །ཨོཾ་མ་ཧཱ་དྷཱུ་པ་མེ་གྷ་པ་ཊ་ལ་སཉྩ་དཱ་ཡ།
en: 66] “Oṁ, great cloud of incense!

source: ས་མནྟེ་ན་ཧཱུྃ་སྭཱ་ཧཱ།
en: Envelope everything around! Hūṁ hūṁ, svāhā! “

source: བདུག་པའི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for the incense; it should be recited twenty-one times. [

source: །ཨོཾ་ཨ་ཐརྦ་ནི་ཛྭ་ལ་ཛྭ་ལ་དེ་བ་མུ་ཁེ་སྭཱ་ཧཱ།
en: 67] “Oṁ, magical being! Blaze, blaze! You are the face of the gods!

source: མེའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: Svāhā! “This is the mantra for the fire; it should be recited seven times. [68] “Oṁ, various jewels! Shining adornments of gold and precious stone!

source: །ཨོཾ་བི་བི་དྷ་མ་ཎི་ཀ་ན་ཀ་ར་ཏྣོ་ཛྭ་ལ་པཱུ་ཥ་ཎ་མ་ཎི་མ་ཎི་ཨ་མོ་གྷ་མ་ཎི་སྭཱ་ཧཱ།
en: Jewel, jewel, amogha jewel! Svāhā! “

source: ཆ་ཞིང་བརྒྱན་པའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the adornments; it should be recited seven times. [

source: །ཨོཾ་པདྨ་ཀ་རེ་བི་མ་ལན་ཁ།
en: 69] “Oṁ oṁ, lotus hands!

source: ཨང་གུ་ལི།
en: Sama sama!

source: ས་མ་ས་མ་སརྦ་ཏ་ཐཱ་ག་ཏ།
en: Fingers with broad fingernails! Blessed by all the tathāgatas!

source: ཨ་དྷི་ཥྛི་ཏེ་སྭཱ་ཧཱ།
en: Svāhā! “

source: ཐལ་མོ་སྦྱར་བའི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for the añjali gesture; it should be recited twenty-one times. [

source: །ཨོཾ་སརྦ་གུ་ཎ་པྲ་ཎ་ཏ།
en: 70] “Oṁ, bowing my head, I pay homage to the perfect one with all the qualities!

source: ཤི་རོ་བཾ་ད་ནཱ་ཡ་ན་མ་སྐ་རོ་མི། མི་ལི་མི་ལི་ཏུ་རི་ཎི་སྭཱ་ཧཱ།
en: Mili mili, turiṇi, svāhā! “

source: ཕྱག་བགྱི་བའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra of salutation; it should be recited seven times. [71] “Oṁ, may my homage extend through the ten directions!

source: །ཨོཾ་ད་ཤ་དི་ཤ་ཨ་བྷི་བན་ད་ན་པྲ་ས་ར་ཏུ་ཧཱུྃ།
en: Hūṁ! “

source: བསྐོར་བའི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for clockwise circumambulation; it should be recited twenty-one times. [

source: །ཨོཾ་བི་བི་དྷཱ་ཡུ་དྷཱ་ཛྭ་ལི་ཏ་པ་ནི།
en: 72] “Oṁ, hand, you are ablaze with various implements!

source: པྲ་ཛྭ་ལ་པྲ་སྥུར་ཧཱུྃ།
en: Blaze forth, shine, hūṁ! “

source: ཐལ་མོའི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for the handheld implements; it should be recited twenty-one times. [

source: །ཨོཾ་དི་བྱ་ཨ་མོ་གྷ་བི་པུ་ལ་སྭ་རེ་མ་དྷུ་ར་ནི་ར་གྷོ་ཥ་རུ་ཏེ་ན་ར་ཎ་ར་ཎ་ཧཱུྃ།
en: 73] “Oṁ, you with the divine amogha sound that spreads far and wide! You with a sweet tone! Ring, ring, hūṁ! “

source: དྲིལ་བུའི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ། །ཡང་ན་བརྒྱ་རྩ་བརྒྱད་དོ།
en: This is the mantra for the bell; it should be recited either twenty-one or one hundred and eight times. [

source: །ཨོཾ་ར་སྨི་ཛྭ་ལ་ས་མནྟེ་མ།
en: 74] “Oṁ, you with the great jewel-like flame!

source: ཨ་བ་བྷ་ས་ཡ་མ་ཧཱ་མ་ཎི་རཏྣ་ཤི་ཁེ་སྭཱ་ཧཱ།
en: Illuminate everything around with your bright light, svāhā! “

source: མར་མེའི་གསང་སྔགས་ཏེ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་སོ།
en: This is the mantra for the lamp; it should be recited one hundred and eight times. [

source: །ཨོཾ་དྷུ་རུ་དྷུ་རུ་ཨ་པཱ་ཧཱ་ཡ་ཤཱི་གྷྲཾ་ཛ་བེ་ཧཱུཾ།
en: 75] “Oṁ, dhuru dhuru! Bring over! O speedy one, hūṁ! “

source: དགུག་པའི་གསང་སྔགས་ཏེ་གུ་གུལ་གྱི་བདུག་པ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་སོ།
en: This is the mantra for summoning. It should be recited one hundred and eight times while burning agarwood incense. [

source: །ཨོཾ་དུཥྛཱ་ས་དོ་བི་བོ་དྷ་ནི།
en: 76] “Oṁ, you bring realization to wicked beings!

source: ས་མ་ས་མ་ཡ་བ་རེ་སྭཱ་ཧཱ།
en: Sama, holder of the samaya, svāhā! “

source: དམ་ཚིག་གི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the samaya mantra; it should be recited twenty-one times. [

source: །ཨོཾ་བི་ཙི་ཏྲ་མ་ནི་བི་བུ་ལ་པྲ་བརྟ་ནི་ཧཱུྃ།
en: 77] “Oṁ, bright jewels, turned many times, hūṁ! “

source: བགྲང་ཕྲེང་གི་གསང་སྔགས་ཏེ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་སོ།
en: This is the mantra for the rosary; it should be recited one hundred and eight times. [

source: །ཨོཾ་བི་ཅི་ཏྲ་ཏྣོ་ཛྭ་ལོ་དི་བྱ།
en: 78] “Oṁ, you are made of divine flowers that blaze with colors like jewels!

source: ཀུ་སུ་མ་བ་རེ་པུཥྤ་ར་ཏི་སྭཱ་ཧཱ།
en: O flower delight, svāhā! “

source: མེ་ཏོག་ཕྲེང་བའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra of the garland; it should be recited seven times. [

source: །ཨོཾ་དི་བྱ་ལོ་ཙ་ནེ་ཨ་མོ་གྷ་པྲ་བ་རེ།
en: 79] “Oṁ, divine, unfailing eye!

source: སརྦ་དི་བྱ་ཨ་དྷི་ཥྛི་ཏ།
en: Supreme and perfect! Blessed by all the vidyās!

source: སིད་དྷི་ཤུད་དྷ་བི་ལོ་ཀི་ཏེ་སྭཱ་ཧཱ།
en: Your perception is pure, svāhā! “

source: དགུག་པའི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra of summoning; it should be recited twenty-one times. [

source: །ཨོཾ་ཨ་མོ་གྷ་པདྨེ་ས་མནྟ་ཤུ་བྷ་ནེ་ཏ་ར་ཏ་ར་གཙྪ་སྭ་བྷཱ་བ་ནཾ་སྭཱ་ཧཱ།
en: 80] “Oṁ, amogha lotus, you are an all-encompassing residence! Tara tara! Depart to your homes, svāhā! “

source: སླར་གཤེགས་སུ་གསོལ་བའི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for dismissing; it should be recited twenty-one times. [

source: །ཨོཾ་དི་བྱ་སཾ་པཱུ་ར་ཎི་ནཱ་ག་བི་ལོ་ཀི་ན་ཧཱུྃ།
en: 81] “Oṁ, divine fulfiller with an elephant’s gaze,hūṁ! “

source: འཁར་གསིལ་གྱི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for the monk’s staff; it should be recited twenty-one times. [

source: །ཨོཾ་པ་ཏྲ་པཱུ་ར་ཎི་པཱུ་ར་ཡ།
en: 82] “Oṁ, filler of the alms bowl!

source: ཨ་མོ་གྷ་བ་ཏིས་མནྟ་པྲ་བྷེ་སྭཱ་ཧཱ།
en: Fill it up! You with a radiating halo who never fails, svāhā! “

source: ལྷུང་བཟེད་ཀྱི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra for the alms bowl; it should be recited twenty-one times. [

source: །ཨོཾ་དཱུརྦ་སཾ་སྠ་ལ་བིད་དྷི་ཨ་དྷི་ཥྛི་ཏ་པྲ་ས་ར་སུ་རུ་སུ་ར།
en: 83] “Oṁ, the bed of darbha grass blessed by the vidyās!

source: རྀ་ཥི་པཱུ་ཛི་ཏེ་སྭཱ་ཧཱ།
en: Spread! Sura sura! You are worshiped by sages, svāhā! “

source: རྩྭ་གདིང་བའི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra of the bed of darbha grass; it should be recited twenty-one times. [84] “Oṁ, fire and smoke!

source: །ཨོཾ་ཛྭ་ལ་དྲུ་མ་ཛྭ་ལ་ཤི་ཁི་ར་སྨི་གར་བྷེ་སྭཱ་ཧཱ།
en: Blazing flames! Impregnated with light! Svāhā! “

source: སྦྱིན་སྲེག་གི་གསང་སྔགས་ཏེ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་སོ།
en: This is the mantra for the homa offering; it should be recited one hundred and eight times. [

source: །ཨོཾ་པདྨེ་ནི་པདྨཱ་ས་ནེ་བ་རེ་པྲ་བ་རེ་ནཱ་ག་བྷུ་བ་ནེ་སྭཱ་ཧཱ།
en: 85] “Oṁ, the most exquisite place and the abode of lotuses! The dwelling place of the nāgas, svāhā! “

source: འབབ་ཆུ་དང་མཚོའི་གསང་སྔགས་ཏེ་ལན་བདུན་བཟླས་སོ།
en: This is the mantra for the river and lake; it should be recited seven times. [86] “Oṁ, sky traveler!

source: །ཨོྃ་ཁ་ག་ཙ་རི་ཎི།
en: Move and make move!

source: ག་མ་ག་མ་ཡ་པཱ་ད་པྲ་ཙ་རི་ཎི་ཧཱུྃ།
en: You make the feet move, hūṁ! “

source: ལེན་པའི་གསང་སྔགས་ཏེ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་སོ།
en: This is the mantra of taking; it should be recited one hundred and eight times. [

source: །ཨོཾ་སརྦ་ཧྲ་ཨ་མོ་གྷཱ་བྷི་ཥི་ཀ་མ་ཧཱ་ཙཱུ་ཌ་བི་མ་ལེ་ཨ་བྷི་ཥིཉྩི་ཏུ་མཱཾ།
en: 87] “Oṁ, the pure, universal amogha empowerment applied to the top of the head!

source: པྲ་བར་པ་ཎི་བྷུ་ཛེ་པདྨེ་དྷཱ་ཛེ་སྭཱ་ཧཱ།
en: O holder of a lotus banner with fine arms and hands, consecrate me, svāhā! “

source: དབང་བསྐུར་བའི་གསང་སྔགས་ཏེ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་སོ།
en: This is the mantra of empowerment; it should be recited twenty-one times. “

source: །རིགས་སྔགས་འཆང་གིས་གསང་སྔགས་འདི་དག་ཐམས་ཅད་སོ་སོར་ཆོ་ག་ཞིབ་མོའི་སྒྲུབ་པ་ཅི་ལྟ་བ་བཞིན་དུ་ཐམས་ཅད་སོ་སོར་སྦྱར་ནས།
en: The vidyā holder should employ all these mantras individually, one after the other, as part of his practice.

source: ཆོ་ག་བསྒྲུབས་ན་དགོས་པ་རྒྱ་ཆེན་པོའི་འབྱོར་པའི་མཐུ་འདི་དག་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་།
en: They must be performed according to procedure, following in detail the practice rules prescribed for the individual rites.

source: དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། རིན་པོ་ཆེའི་སྣོད་སྣ་ཚོགས་པ་དང་། ནོར་བུ་སྣ་ཚོགས་པའི་གཞལ་མེད་ཁང་རྒྱ་ཆེན་པོ་འབྱུང་བར་འགྱུར་རོ།
en: After he has done so, great powers and riches will manifest, such as great jewel palaces, various colorful jewel objects, flowers, incense, perfume, garlands, and scented oils.

source: །ལྷའི་མེ་ཏོག་དང་། གདུགས་དང་། བ་དན་སྣ་ཚོགས་པ་འབྱུང་བར་འགྱུར་རོ། །རོ་བརྒྱ་དང་ལྡན་པའི་ཁ་ཟས་ཀྱི་མཆོག་དང་། རོ་སྣ་ཚོགས་པའི་མཆོག་རྣམས་འབྱུང་བར་འགྱུར་རོ། །གཏོར་མ་བཟང་པོ་རྣམ་པ་སྣ་ཚོགས་པ་ཡང་འབྱུང་བར་འགྱུར་རོ། །ཅི་ཙམ་དེ་བཞིན་གཤེགས་པ་ལ་འོས་པའི་གཞལ་མེད་ཁང་དག་འབྱུང་བར་འགྱུར་རོ།
en: Various divine flowers, streamers, and banners will appear, as will the choicest foods of hundreds of exquisite flavors and various oblatory articles.

source: །བྱང་ཆུབ་སེམས་དཔའི་གཞལ་མེད་ཁང་ཅི་ལྟ་བ་དེ་ལྟ་བུ་དག་འབྱུང་བར་འགྱུར་རོ། །ལྷ་རྣམས་ཀྱི་གཞལ་མེད་ཁང་ཅི་ལྟ་བ་དེ་ལྟ་བུ་དག་འབྱུང་བར་འགྱུར་རོ། །ཀླུ་རྣམས་དང་། གནོད་སྦྱིན་རྣམས་དང་། ལྷ་མ་ཡིན་རྣམས་དང་།
en: There will appear palaces fit for tathāgatas, bodhisattvas, devas, nāgas, yakṣas, asuras, garuḍas, kinnaras, and mahoragas; these palaces will manifest to suit each particular class.
